In [26]:
import pandas as pd

In [27]:
df=pd.read_csv("C:/Datasets/Titanic.csv")
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [28]:
y=df["Survived"]

In [29]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [30]:
x=df.drop("Survived", axis=1)

In [31]:
 x.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
x=x.drop(["PassengerId","Name","Ticket","Embarked","Cabin"],axis=1)

In [33]:
 x.isna().sum()

Pclass      0
Sex         0
Age       177
SibSp       0
Parch       0
Fare        0
dtype: int64

In [34]:
y.isna().sum()

0

In [36]:
x["Age"]=x["Age"].fillna(x["Age"].mean())

In [37]:
x.isna().sum()

Pclass    0
Sex       0
Age       0
SibSp     0
Parch     0
Fare      0
dtype: int64

In [38]:
x.dtypes

Pclass      int64
Sex        object
Age       float64
SibSp       int64
Parch       int64
Fare      float64
dtype: object

In [40]:
x=pd.get_dummies(x,columns=["Sex"],drop_first=True)

In [41]:
x.head(5)

   Pclass   Age  SibSp  Parch     Fare  Sex_male
0       3  22.0      1      0   7.2500         1
1       1  38.0      1      0  71.2833         0
2       3  26.0      0      0   7.9250         0
3       1  35.0      1      0  53.1000         0
4       3  35.0      0      0   8.0500         1

In [43]:
type(x)

pandas.core.frame.DataFrame

In [44]:
x.shape

(891, 6)

In [45]:
from sklearn.model_selection import train_test_split

In [46]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=42,stratify=y)

In [47]:
from sklearn.preprocessing import MinMaxScaler

In [48]:
scaler=MinMaxScaler()

In [49]:
x_train=scaler.fit_transform(x_train)

In [50]:
x_test=scaler.transform(x_test)

In [51]:
from sklearn.linear_model import LogisticRegression

In [52]:
model=LogisticRegression()

In [53]:
model.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [54]:
model.score(x_test,y_test)

0.7873134328358209

In [55]:
data=pd.DataFrame({"First":[7],"Second":[1],"Three":["Rohan Walekar"],"Fourth":["Female"],"Fifth":[22],
                  "Sixth":[2],"Seventh":[3],"Eight":["AC 34343"],"Ninth":[71],"Tenth":["C324"],"Eleventh":["S"]})

In [56]:
data=data.drop(["First","Three","Eight","Tenth","Eleventh"],axis=1)

In [58]:
data=pd.get_dummies(data,columns=["Fourth"])

In [59]:
data

   Second  Fifth  Sixth  Seventh  Ninth  Fourth_Female
0       1     22      2        3     71              1

In [60]:
data.loc[0,"Fourth_Female"]=0

In [61]:
data

   Second  Fifth  Sixth  Seventh  Ninth  Fourth_Female
0       1     22      2        3     71              0

In [62]:
data=scaler.transform(data)

In [64]:
model.predict(data)

array([1], dtype=int64)